// 1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor). Скласти результат цих чисел в змінній result.

// let arr = [];
//
// let result = 0;
//
// for (let i = 0; i < 10; i++) {
//     arr[i] = Math.floor(Math.random() * 10);
// }
// console.log(arr);
//
// for (let i = 0; i < arr.length; i++) {
//     result += arr[i]
// }
//
// console.log(result);

// 2. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр

// let book1 = {
//     name: '',
//     num_pages: '',
//     genre: ''
// }

// 3. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автори

// let book2 = {
//     name: '',
//     num_pages: '',
//     genre: '',
//     authors: ''
// }


// 4. Створити маис об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори. Вивести кожну книгу як окремий об'єкт

// let arr_books = [
//     {
//         name: '',
//         num_pages: '',
//         genre: '',
//         authors: ''
//     },
//     {
//         name: '',
//         num_pages: '',
//         genre: '',
//         authors: ''
//     }
// ]
//
// console.log(arr_books[0]);
// console.log(arr_books[1]);


// 5. Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
// Значення площі зберігати в змінній s.

let height = 23;
let width = 10;
let s = height * width;

// 6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
// результат помістіть у змінну v.

let heightC = 10;
let dC = 4;
let v = PI * ((dC / 2) ** 2) * heightC


// 7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
// Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **).

let n = 3;
let m = 4;
let k = n**2 + m**2

result = Math.sqrt(k)


