// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

// let num_1 = 1;
// let num_2 = 2;
//
// if (num_1 > num_2) {
//     console.log(`Більше число ${num_1}`)
// } else if (num_1 < num_2) {
//     console.log(`Більше число ${num_2}`)
// } else {
//     console.log(`Число ${num_1} і ${num_2} рівні`)
// }


// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let some_num = prompt('Ведіть номер квартири')
//
// if (some_num >= 1 && some_num <= 20) {
//     console.log(`Перший підїзд`)
// } else if (some_num >= 21 && some_num <= 48) {
//     console.log(`Другий підїзд`)
// } else if (some_num >= 49 && some_num <= 90) {
//     console.log(`Третій підїзд`)
// } else {
//     console.log(`Ти будинком не помилився?`)
// }


// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let number = 55;
// number === 10 ? console.log(`ВІРНО`) : console.log(`НЕВІРНО`)


// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

// let x = 1
// if (typeof x === 'number') {
//     console.log("number")
// } else if (typeof x === 'string') {
//     console.log("string")
// } else if (typeof x == 'boolean') {
//     console.log("boolean")
// } else if (typeof x === 'object') {
//     console.log("object")
// } else {
//     console.log("something")
// }


// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

let temp = 22;

temp >= 10 && temp <= 22 ? console.log("ми йдемо ВЧИТИСЯ") : console.log("вчимося ОНЛАЙН")


// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

let lot = 1;

switch (lot) {
    case 1:
        console.log('Tesla 3');
        break;
    case 2:
        console.log('MOTO');
        break;
    case 3:
        console.log('Phone');
        break;
    default:
        console.log('error');
}